PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/mai_main.c
            lastStateButton_ = true;
            ++ cntButtonPress_;
        }
    }
    else
        lastStateButton_ = false;

    static int cntIsOn_ = 0;
    if(++cntIsOn_ >= 500)
        cntIsOn_ = -500;
    lbd_setLED(_ledTask1ms, /* isOn */ cntIsOn_ >= 0);

} /* End of task1ms */




/**
 * Task function, cyclically activated every 3ms.
 */
static void task3ms(void)
{
    checkAndIncrementTaskCnts(idTask3ms);
    ++ mai_cntTask3ms;

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 150 /* approx. 5% load */);
#endif    
    
} /* End of task3ms */



/**
 * Task function, cyclically activated every second.
 */
static void task1s(void)
{
    checkAndIncrementTaskCnts(idTask1s);

    ++ mai_cntTask1s;

    static int cntIsOn_ = 0;
    if(++cntIsOn_ >= 1)
        cntIsOn_ = -1;
    lbd_setLED(_ledTask1s, /* isOn */ cntIsOn_ >= 0);

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software.
         Note, the cyclic task taskCpuLoad has a period time of 23 ms and it has the same
       priority as this task. Because of the busy loop here and because the faster task
       itself has a non negligible execution time, there's a significant chance of loosing
       an activation of the faster task once a second. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 20000 /* approx. 2% load */);
#endif    

    /* Simple code: First calculation of time to print is wrong. */
    static unsigned long tiPrintf = 0;
    unsigned long long tiFrom = GSL_PPC_GET_TIMEBASE();
    iprintf( "CPU load is %u.%u%%. Stack reserve: %u Byte. Task activations (lost):\r\n"
             "  task1ms: %lu (%u)\r\n"
             "  task3ms: %lu (%u)\r\n"
             "  task1s: %lu (%u)\r\n"
             "  taskNonCyclic: %lu (%u)\r\n"
             "  task17ms: %lu (%u)\r\n"
             "  taskOnButtonDown: %lu (%u)\r\n"
             "  taskCpuLoad: %lu (%u)\r\n"
             "  taskIdle: %lu\r\n"
             "  tiPrintf = %luus\r\n"
           , mai_cpuLoad/10, mai_cpuLoad%10
           , rtos_getStackReserve()
           , mai_cntTask1ms, rtos_getNoActivationLoss(idTask1ms)
           , mai_cntTask3ms, rtos_getNoActivationLoss(idTask3ms)
           , mai_cntTask1s, rtos_getNoActivationLoss(idTask1s)
           , mai_cntTaskNonCyclic, rtos_getNoActivationLoss(idTaskNonCyclic)
           , mai_cntTask17ms, rtos_getNoActivationLoss(idTask17ms)
           , mai_cntTaskOnButtonDown, rtos_getNoActivationLoss(idTaskOnButtonDown)
           , mai_cntTaskCpuLoad, rtos_getNoActivationLoss(idTaskCpuLoad)
           , mai_cntTaskIdle
           , tiPrintf
           );
    tiPrintf = (unsigned long)(GSL_PPC_GET_TIMEBASE() - tiFrom) / 120;

} /* End of task1s */



/**
 * A non cyclic task, which is solely activated by software triggers from other tasks.
 */
static void taskNonCyclic(void)
{
    checkAndIncrementTaskCnts(idTaskNonCyclic);
    ++ mai_cntTaskNonCyclic;

} /* End of taskNonCyclic */



/**
 * Task function, cyclically activated every 17ms.
 */
static void task17ms(void)
{
    checkAndIncrementTaskCnts(idTask17ms);
    ++ mai_cntTask17ms;

    /* This task has a higher priority than the software triggered, non cyclic task. Since
       the latter one is often active we have a significant likelihood of a failing
       activation from here -- always if we preempted the non cyclic task.
         Note, activating one and the same task from different contexts requires a critical
       section. This task had got the high application task priority so that the explicit
       Get/ReleaseResource could be omitted. Doing so would however break the possibility
       to play with the sample code and to arbitrarily change the priorities in the
       heading part of this file. */
    GetResource(RESOURCE_ACTIVATE_TASK_NON_CYCLIC);
    {
        if(!rtos_activateTask(idTaskNonCyclic))
            ++ mai_cntActivationLossTaskNonCyclic;
    }
    ReleaseResource();

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 17*40 /* approx. 4% load */);
#endif    
    
    /* A task can't activate itself, we do not queue activations and it's obviously active
       at the moment. Test it. */
#ifdef DEBUG
    bool bActivationAccepted =
#endif
    rtos_activateTask(idTask17ms);
    assert(!bActivationAccepted);

} /* End of task17ms */



/**
 * A non cyclic task, which is activated by software trigger every time the button on the
 * evaluation board is pressed.
 */
static void taskOnButtonDown(void)
{
    checkAndIncrementTaskCnts(idTaskOnButtonDown);
    ++ mai_cntTaskOnButtonDown;
    iprintf("You pressed the button the %lu. time\r\n", mai_cntTaskOnButtonDown);

    /* Change the value of artificial CPU load on every click by 10%. */
    if(_cpuLoadInPercent < 100)
        _cpuLoadInPercent += 10;
    else
        _cpuLoadInPercent = 0;
    iprintf("The additional, artificial CPU load has been set to %u%%\r\n", _cpuLoadInPercent);

} /* End of taskOnButtonDown */


/**
 * A cyclic task of low priority, which is used to produce some artificial CPU load.
 *   @remark
 * We need to consider that in this sample, the measurement is inaccurate because the
 * idle loop is not empty (besides measuring the load) and so the observation window is
 * discontinuous. The task has a cycle time of much less than the CPU measurement
 * observation window, which compensates for the effect of the discontinuous observation
 * window.
 */
static void taskCpuLoad(void)
{
    checkAndIncrementTaskCnts(idTaskCpuLoad);
    testPCP(idTaskCpuLoad);
    
    ++ mai_cntTaskCpuLoad;

    /* Producing load is implemented as producing full load for a given span of world time.
       This is not the same as producing an additional load of according percentage to the
       system since the task may be preempted and time elapses while this task is not
       loading the CPU. The percent value is only approximately. */
    const unsigned int tiDelayInUs = 23 /* ms = cycle time of this task */
                                     * 1000 /* ms to us to improve resolution */
                                     * _cpuLoadInPercent
                                     / 100;
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ tiDelayInUs);

} /* End of taskCpuLoad */




/**
 * Entry point into C code. The C main function is entered without arguments and despite of
 * its return code definition it must never be left. (Returning from main would enter an
 * infinite loop in the calling assembler startup code.)
 */
void main(void)
{
    /* The first operation of the main function is the call of ihw_initMcuCoreHW(). The
       assembler implemented startup code has brought the MCU in a preliminary working
       state, such that the C compiler constructs can safely work (e.g. stack pointer is
       initialized, memory access through MMU is enabled).
         ihw_initMcuCoreHW() does the remaining hardware initialization, that is still
       needed to bring the MCU in a basic stable working state. The main difference to the
       preliminary working state of the assembler startup code is the selection of
       appropriate clock rates. Furthermore, the interrupt controller is configured.
         This part of the hardware configuration is widely application independent. The
       only reason, why this code has not been called directly from the assembler code
       prior to entry into main() is code transparency. It would mean to have a lot of C
       code without an obvious point, where it is called. */
    ihw_initMcuCoreHW();

#ifdef DEBUG
    /* Check linker script. It's error prone with respect to keeping the initialized RAM
       sections and the according initial-data ROM sections strictly in sync. As long as
       this has not been sorted out by a redesign of linker script and startup code we put
       a minimal plausibility check here, which will likely detect typical errors.
         If this assertion fires your initial RAM contents will be corrupt. */
    extern const uint8_t ld_dataSize[0], ld_dataMirrorSize[0];
    assert(ld_dataSize == ld_dataMirrorSize);
#endif

    /* Initialize the button and LED driver for the eval board. */
    lbd_initLEDAndButtonDriver();

