PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/mai_main.c
    /* Initialize the serial output channel as prerequisite of using printf. */
    sio_initSerialInterface(/* baudRate */ 115200);

    /* The external interrupts are enabled after configuring I/O devices. (Initialization
       of the RTOS can be done later.) */
    ihw_resumeAllInterrupts();

    /* The RTOS is restricted to eight tasks at maximum. */
    _Static_assert(noTasks <= 8, "RTOS only supports eight tasks");

    /* Register the application tasks at the RTOS. Note, we do not really respect the ID,
       which is assigned to the task by the RTOS API rtos_registerTask(). The returned
       value is redundant. This technique requires that we register the task in the right
       order and this requires in practice a double-check by assertion - later maintenance
       errors are unavoidable otherwise. */
#ifdef DEBUG
    unsigned int idTask =
#endif
    rtos_registerTask( &(rtos_taskDesc_t){ .taskFct = task1ms
                                         , .tiCycleInMs = 1
                                         , .priority = prioTask1ms
                                         }
                     , /* tiFirstActivationInMs */ 10
                     );
    assert(idTask == idTask1ms);

#ifdef DEBUG
    idTask =
#endif
    rtos_registerTask( &(rtos_taskDesc_t){ .taskFct = task3ms
                                         , .tiCycleInMs = 3
                                         , .priority = prioTask3ms
                                         }
                     , /* tiFirstActivationInMs */ 17
                     );
    assert(idTask == idTask3ms);

#ifdef DEBUG
    idTask =
#endif
    rtos_registerTask( &(rtos_taskDesc_t){ .taskFct = task1s
                                         , .tiCycleInMs = 1000
                                         , .priority = prioTask1s
                                         }
                     , /* tiFirstActivationInMs */ 100
                     );
    assert(idTask == idTask1s);

#ifdef DEBUG
    idTask =
#endif
    rtos_registerTask( &(rtos_taskDesc_t){ .taskFct = taskNonCyclic
                                         , .tiCycleInMs = 0 /* non-cyclic */
                                         , .priority = prioTaskNonCyclic
                                         }
                     , /* tiFirstActivationInMs */ 0
                     );
    assert(idTask == idTaskNonCyclic);

#ifdef DEBUG
    idTask =
#endif
    rtos_registerTask( &(rtos_taskDesc_t){ .taskFct = task17ms
                                         , .tiCycleInMs = 17
                                         , .priority = prioTask17ms
                                         }
                     , /* tiFirstActivationInMs */ 0
                     );
    assert(idTask == idTask17ms);

#ifdef DEBUG
    idTask =
#endif
    rtos_registerTask( &(rtos_taskDesc_t){ .taskFct = taskOnButtonDown
                                         , .tiCycleInMs = 0 /* Event task, no coycle time */
                                         , .priority = prioTaskOnButtonDown
                                         }
                     , /* tiFirstActivationInMs */ 0
                     );
    assert(idTask == idTaskOnButtonDown);

#ifdef DEBUG
    idTask =
#endif
    rtos_registerTask( &(rtos_taskDesc_t){ .taskFct = taskCpuLoad
                                         , .tiCycleInMs = 23 /* ms */
                                         , .priority = prioTaskCpuLoad
                                         }
                     , /* tiFirstActivationInMs */ 3
                     );
    assert(idTask == idTaskCpuLoad);

    /* The last check ensures that we didn't forget to register a task. */
    assert(idTask == noTasks-1);

    /* Initialize the RTOS kernel. */
    rtos_initKernel();

    /* The code down here becomes our idle task. It is executed when and only when no
       application task is running. */

    while(true)
    {
        checkAndIncrementTaskCnts(pseudoIdTaskIdle);
        testPCP(pseudoIdTaskIdle);
        ++ mai_cntTaskIdle;

        /* Activate the non cyclic task. Note, the execution time of this task activation
           will by principle not be considered by the CPU load measurement started from the
           same task (the idle task). */
#ifdef DEBUG
        bool bActivationAccepted =
#endif
        rtos_activateTask(idTaskNonCyclic);
        assert(bActivationAccepted);

        /* Compute the average CPU load. Note, this operation lasts about 1s and has a
           significant impact on the cycling speed of this infinite loop. Furthermore, it
           measures only the load produced by the tasks and system interrupts but not that
           of the rest of the code in the idle loop. */
        mai_cpuLoad = gsl_getSystemLoad();

        /* In PRODUCTION compilation we print the inconsistencies found in the PCP test. */
        if(_sharedDataTasksIdleAnd1msAndCpuLoad.noErrors != 0)
        {
            iprintf( "CAUTION: %u errors found in PCP self-test!\r\n"
                   , _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors
                   );
        }
#if 0
        /* Test of return from main: After 10s */
        if(mai_cntTask1ms >= 10000)
            break;
#endif
    }
} /* End of main */
